# Dataframes in Panda

In [1]:
import pandas as pd

In [10]:
data = {"primer_nombre":["Juan","Pedro","Luisa","Camila"],
       "segundo_nombre":["Pablo","Sebastian","Fernanda","Laura"],
       "estatura(m)":[1.5,1.68,1.80,1.7],
        "estudia":["No","Si","Si","No"]}

In [11]:
df = pd.DataFrame(data)

In [12]:
df

  primer_nombre segundo_nombre  estatura(m) estudia
0          Juan          Pablo         1.50      No
1         Pedro      Sebastian         1.68      Si
2         Luisa       Fernanda         1.80      Si
3        Camila          Laura         1.70      No

In [13]:
df["primer_nombre"]

0      Juan
1     Pedro
2     Luisa
3    Camila
Name: primer_nombre, dtype: object

In [14]:
df["estatura(in)"] = df["estatura(m)"]* 39.3701

In [15]:
df["estatura(in)"]

0    59.055150
1    66.141768
2    70.866180
3    66.929170
Name: estatura(in), dtype: float64

In [22]:
df.dtypes

primer_nombre       object
segundo_nombre      object
estatura(m)        float64
estudia           category
estatura(in)       float64
dtype: object

In [21]:
df["estudia"]=df["estudia"].astype("category")

In [23]:
df

  primer_nombre segundo_nombre  estatura(m) estudia  estatura(in)
0          Juan          Pablo         1.50      No     59.055150
1         Pedro      Sebastian         1.68      Si     66.141768
2         Luisa       Fernanda         1.80      Si     70.866180
3        Camila          Laura         1.70      No     66.929170

In [27]:
df["apellido"]=["Fonseca","Rosales","Salomon","Martinez"]

In [28]:
df

  primer_nombre segundo_nombre  estatura(m) estudia  estatura(in)  apellido
0          Juan          Pablo         1.50      No     59.055150   Fonseca
1         Pedro      Sebastian         1.68      Si     66.141768   Rosales
2         Luisa       Fernanda         1.80      Si     70.866180   Salomon
3        Camila          Laura         1.70      No     66.929170  Martinez

In [29]:
df.shape

(4, 6)

In [30]:
df["codigo"]=["L1","G2","P1","K2"]

In [33]:
df.set_index("codigo",inplace=True)

In [34]:
df

,primer_nombre,segundo_nombre,estatura(m),estudia,estatura(in),apellido
codigo,,,,,,
L1,Juan,Pablo,1.50,No,59.055150,Fonseca
G2,Pedro,Sebastian,1.68,Si,66.141768,Rosales
P1,Luisa,Fernanda,1.80,Si,70.866180,Salomon
K2,Camila,Laura,1.70,No,66.929170,Martinez